#### PointCollection Members

---

|  |
| --- |
| PointCollection Class   Methods   Properties   See Also |

The  PointCollection  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  PointCollection |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Protected method | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPointBufferPointer | Returns an unsafe pointer to the buffer in which this collection stores the points. |
| Public method | GetPointIterator | Creates and returns an iterator for the points contained in this collection. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Count | The number of points in this collection. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

PointCollection Class

Autodesk.Revit.DB.PointClouds Namespace